
// Просто файл настройки бота, где можно указать основные параметры. Особо вдаваться в подробности, я не собираюсь


module.exports = {

  // Имя бота

  botName:        `JustGame`,

  // Параметры группы

    groupToken: 'b51c95126e9777cb1f8f4523abceb725c48b987c1f5c5e3128f0f85983a5708f98c7d4f87829cb4212098',
    groupID: 199117984,

  // VKCoin

    vkcKey: `234234234234`,
    vkcID: `23434234234`,
  
  // PaperScroll
    
    psid: `2342344`,
    pskey: `234324234`,

  // CoronaCoin

    cckey: `2342342342343`,
    ccid: ``,

  // GameCoin
    gckey: `234234234234`,
    gcid: ``,


  // База данных

  urlDB:          'mongodb://127.0.0.1:27017/',
  nameDB:         'just_game_vkcoin',

  // Награды за топ

    PSTop: [10000000000, 5000000000, 3000000000, 1000000000, 750000000, 500000000, 250000000, 125000000, 75000000, 50000000],




};
